* Recover

- When panic is called, it immediately stops execution of the current
  function and begins unwinding the stack of the goroutine, running
  any deferred functions along the way.
- It is possible to use the built-in function recover to regain
  control of the goroutine and resume normal execution.
- Because the only code that runs while unwinding is inside deferred
  functions, *recover* is only useful inside deferred functions.

#+begin_src go :imports '("log")
  func main() {
          defer func() {
                  if err := recover(); err != nil {
                          log.Println("disappointed: ", err)
                  }
          }()
          panic("Hello world")
  }
#+end_src

#+RESULTS:
2024/02/29 16:28:18 disappointed:  Hello world
